In [67]:
import numpy as np
import pandas as pd

# Finding Missing Data

In [68]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [5, 4, 3, 2, 1],
    'C': [2, 3, 4,np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)
df

     A  B    C    D
0  1.0  5  2.0  1.0
1  2.0  4  3.0  NaN
2  NaN  3  4.0  NaN
3  4.0  2  NaN  NaN
4  5.0  1  NaN  5.0

In [69]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [70]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [71]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

# Removing missing Data

In [72]:
df

     A  B    C    D
0  1.0  5  2.0  1.0
1  2.0  4  3.0  NaN
2  NaN  3  4.0  NaN
3  4.0  2  NaN  NaN
4  5.0  1  NaN  5.0

#check one by one all command to drop missing values

In [73]:
           
df.dropna() # drop all rows with missing values
# df.dropna(axis=1) # drop all columns with missing values
# df.dropna(thresh=2) # drop all rows that have  2 non null  values

# df.dropna(how='all') # drop all rows where all columns are missing
# df.dropna(subset=['A', 'B']) # drop all rows where missing values are in col1 or col2

     A  B    C    D
0  1.0  5  2.0  1.0

In [74]:
df

     A  B    C    D
0  1.0  5  2.0  1.0
1  2.0  4  3.0  NaN
2  NaN  3  4.0  NaN
3  4.0  2  NaN  NaN
4  5.0  1  NaN  5.0

In [75]:
df.dropna(thresh=3) # drop all rows where 3 non null values are present

     A  B    C    D
0  1.0  5  2.0  1.0
1  2.0  4  3.0  NaN
4  5.0  1  NaN  5.0

# Filling the missing data

In [76]:
df

     A  B    C    D
0  1.0  5  2.0  1.0
1  2.0  4  3.0  NaN
2  NaN  3  4.0  NaN
3  4.0  2  NaN  NaN
4  5.0  1  NaN  5.0

In [77]:
df.fillna(0) # fill all missing values with 0

     A  B    C    D
0  1.0  5  2.0  1.0
1  2.0  4  3.0  0.0
2  0.0  3  4.0  0.0
3  4.0  2  0.0  0.0
4  5.0  1  0.0  5.0

In [78]:
values = {
    'A': 10,
    'B':100,
    'C': 1000,
    'D': 10000
}
df.fillna(value = values)

      A  B       C        D
0   1.0  5     2.0      1.0
1   2.0  4     3.0  10000.0
2  10.0  3     4.0  10000.0
3   4.0  2  1000.0  10000.0
4   5.0  1  1000.0      5.0

In [79]:
df

     A  B    C    D
0  1.0  5  2.0  1.0
1  2.0  4  3.0  NaN
2  NaN  3  4.0  NaN
3  4.0  2  NaN  NaN
4  5.0  1  NaN  5.0

In [84]:
# df.fillna(df.mean()) # fill all missing values with mean of the column

df.fillna(df.median()) # fill all missing values with median of the column
# df.fillna(df.mode().iloc[0]) # fill all missing values with mode of the column

     A  B    C    D
0  1.0  5  2.0  1.0
1  2.0  4  3.0  3.0
2  3.0  3  4.0  3.0
3  4.0  2  3.0  3.0
4  5.0  1  3.0  5.0